{
    "class_name": "Functional",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        18
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Reshape",
                "config": {
                    "name": "reshape",
                    "trainable": true,
                    "dtype": "float32",
                    "target_shape": [
                        9,
                        2
                    ]
                },
                "name": "reshape",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "reshape",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.__operators__.add",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.add"
                },
                "name": "tf.__operators__.add",
                "inbound_nodes": [
                    [
                        "dense",
                        0,
                        0,
                        {
                            "y": [
                                [
                                    [
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0,
                                        0.0,
                                        1.0
                                    ],
                                    [
                                        0.8414709568023682,
                                        0.5403022766113281,
                                        0.5331684350967407,
                                        0.8460091352462769,
                                        0.3109835982322693,
                                        0.9504152536392212,
                                        0.17689219117164612,
                                        0.9842302203178406,
                                        0.0998334139585495,
                                        0.9950041770935059,
                                        0.05620449781417847,
                                        0.9984192848205566,
                                        0.031617507338523865,
                                        0.999500036239624,
                                        0.017781857401132584,
                                        0.9998418688774109,
                                        0.009999833069741726,
                                        0.9999499917030334,
                                        0.0056233834475278854,
                                        0.9999842047691345,
                                        0.003162272274494171,
                                        0.9999949932098389,
                                        0.00177827849984169,
                                        0.9999983906745911,
                                        0.0009999998146668077,
                                        0.9999995231628418,
                                        0.000562341301701963,
                                        0.9999998211860657,
                                        0.0003162277571391314,
                                        0.9999999403953552,
                                        0.00017782794020604342,
                                        1.0
                                    ],
                                    [
                                        0.9092974066734314,
                                        -0.416146844625473,
                                        0.9021307229995728,
                                        0.431462824344635,
                                        0.5911270976066589,
                                        0.8065783977508545,
                                        0.3482052683830261,
                                        0.9374182820320129,
                                        0.19866932928562164,
                                        0.9800665974617004,
                                        0.1122313141822815,
                                        0.9936820864677429,
                                        0.06320339441299438,
                                        0.9980006814002991,
                                        0.03555808961391449,
                                        0.9993675947189331,
                                        0.019998665899038315,
                                        0.9998000264167786,
                                        0.01124658901244402,
                                        0.9999367594718933,
                                        0.006324513349682093,
                                        0.9999799728393555,
                                        0.0035565514117479324,
                                        0.9999936819076538,
                                        0.0019999986980110407,
                                        0.9999979734420776,
                                        0.0011246823705732822,
                                        0.9999993443489075,
                                        0.0006324555142782629,
                                        0.9999998211860657,
                                        0.00035565588041208684,
                                        0.9999999403953552
                                    ],
                                    [
                                        0.14112000167369843,
                                        -0.9899924993515015,
                                        0.9932531714439392,
                                        -0.11596614122390747,
                                        0.8126488924026489,
                                        0.582753598690033,
                                        0.508536159992218,
                                        0.8610406517982483,
                                        0.29552021622657776,
                                        0.9553365111351013,
                                        0.16790330410003662,
                                        0.985803484916687,
                                        0.0947260931134224,
                                        0.9955033659934998,
                                        0.05332307890057564,
                                        0.9985772967338562,
                                        0.029995501041412354,
                                        0.9995500445365906,
                                        0.01686943881213665,
                                        0.9998577237129211,
                                        0.00948669109493494,
                                        0.9999549984931946,
                                        0.005334813147783279,
                                        0.9999857544898987,
                                        0.0029999956022948027,
                                        0.9999955296516418,
                                        0.0016870232066139579,
                                        0.9999985694885254,
                                        0.0009486831841059029,
                                        0.9999995231628418,
                                        0.000533483806066215,
                                        0.9999998807907104
                                    ],
                                    [
                                        -0.756802499294281,
                                        -0.6536436080932617,
                                        0.7784717679023743,
                                        -0.6276796460151672,
                                        0.9535807371139526,
                                        0.3011374771595001,
                                        0.6528279781341553,
                                        0.7575061917304993,
                                        0.3894183337688446,
                                        0.9210609793663025,
                                        0.2230444848537445,
                                        0.9748082756996155,
                                        0.1261540651321411,
                                        0.9920106530189514,
                                        0.07107120752334595,
                                        0.997471272945404,
                                        0.03998933359980583,
                                        0.9992001056671143,
                                        0.022491756826639175,
                                        0.9997470378875732,
                                        0.01264877337962389,
                                        0.9999200105667114,
                                        0.007113057654350996,
                                        0.9999747276306152,
                                        0.003999989479780197,
                                        0.9999920129776001,
                                        0.0022493633441627026,
                                        0.9999974966049194,
                                        0.0012649106793105602,
                                        0.9999992251396179,
                                        0.0007113117026165128,
                                        0.9999997615814209
                                    ],
                                    [
                                        -0.9589242935180664,
                                        0.28366219997406006,
                                        0.32393521070480347,
                                        -0.9460792541503906,
                                        0.9999465346336365,
                                        -0.010342318564653397,
                                        0.7765299677848816,
                                        0.6300802826881409,
                                        0.4794255495071411,
                                        0.8775825500488281,
                                        0.2774805426597595,
                                        0.9607312679290771,
                                        0.15745589137077332,
                                        0.987525999546051,
                                        0.08879686146974564,
                                        0.9960497617721558,
                                        0.04997916892170906,
                                        0.9987502694129944,
                                        0.028113361448049545,
                                        0.9996047616004944,
                                        0.015810729935765266,
                                        0.999875009059906,
                                        0.008891279809176922,
                                        0.9999604821205139,
                                        0.0049999793991446495,
                                        0.9999874830245972,
                                        0.002811702899634838,
                                        0.9999960660934448,
                                        0.0015811381163075566,
                                        0.9999987483024597,
                                        0.0008891395991668105,
                                        0.9999995827674866
                                    ],
                                    [
                                        -0.279415488243103,
                                        0.9601702690124512,
                                        -0.2303674817085266,
                                        -0.9731037020683289,
                                        0.9471481442451477,
                                        -0.3207964599132538,
                                        0.8757405877113342,
                                        0.4827820062637329,
                                        0.5646424889564514,
                                        0.8253356218338013,
                                        0.33103933930397034,
                                        0.9436169862747192,
                                        0.18860028684139252,
                                        0.9820539355278015,
                                        0.10649443417787552,
                                        0.9943132996559143,
                                        0.059964004904031754,
                                        0.998200535774231,
                                        0.03373407945036888,
                                        0.9994308352470398,
                                        0.018972527235746384,
                                        0.9998199939727783,
                                        0.010669473558664322,
                                        0.9999430775642395,
                                        0.0059999641962349415,
                                        0.9999819993972778,
                                        0.003374041523784399,
                                        0.9999943375587463,
                                        0.0018973654368892312,
                                        0.9999982118606567,
                                        0.0010669674957171082,
                                        0.9999994039535522
                                    ],
                                    [
                                        0.6569865942001343,
                                        0.7539022564888,
                                        -0.7137211561203003,
                                        -0.7004299163818359,
                                        0.8004216551780701,
                                        -0.599437415599823,
                                        0.9473307132720947,
                                        0.3202569782733917,
                                        0.6442176699638367,
                                        0.7648422122001648,
                                        0.38355156779289246,
                                        0.9235194325447083,
                                        0.21955609321594238,
                                        0.9755998849868774,
                                        0.1241583377122879,
                                        0.9922624230384827,
                                        0.06994284689426422,
                                        0.9975510239601135,
                                        0.03935372829437256,
                                        0.9992253184318542,
                                        0.02213413640856743,
                                        0.9997550249099731,
                                        0.01244763471186161,
                                        0.999922513961792,
                                        0.0069999429397284985,
                                        0.9999755024909973,
                                        0.003936379216611385,
                                        0.9999922513961792,
                                        0.002213592641055584,
                                        0.9999975562095642,
                                        0.0012447952758520842,
                                        0.9999992251396179
                                    ],
                                    [
                                        0.9893582463264465,
                                        -0.1455000340938568,
                                        -0.9772617220878601,
                                        -0.21203650534152985,
                                        0.5743177533149719,
                                        -0.8186324834823608,
                                        0.9890424609184265,
                                        0.1476311981678009,
                                        0.7173560857772827,
                                        0.6967067122459412,
                                        0.4348512291908264,
                                        0.9005023241043091,
                                        0.2502923607826233,
                                        0.9681702852249146,
                                        0.1417829692363739,
                                        0.9898977875709534,
                                        0.07991469651460648,
                                        0.9968017339706421,
                                        0.04497213289141655,
                                        0.9989882707595825,
                                        0.025295522063970566,
                                        0.9996800422668457,
                                        0.01422575581818819,
                                        0.9998987913131714,
                                        0.007999914698302746,
                                        0.9999679923057556,
                                        0.00449871551245451,
                                        0.9999898672103882,
                                        0.0025298194959759712,
                                        0.9999967813491821,
                                        0.00142262305598706,
                                        0.9999989867210388
                                    ]
                                ]
                            ],
                            "name": null
                        }
                    ]
                ]
            },
            {
                "class_name": "MultiHeadAttention",
                "config": {
                    "name": "multi_head_attention",
                    "trainable": true,
                    "dtype": "float32",
                    "num_heads": 2,
                    "key_dim": 32,
                    "value_dim": 32,
                    "dropout": 0.0,
                    "use_bias": true,
                    "output_shape": null,
                    "attention_axes": [
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "query_shape": [
                        null,
                        9,
                        32
                    ],
                    "key_shape": [
                        null,
                        9,
                        32
                    ],
                    "value_shape": [
                        null,
                        9,
                        32
                    ]
                },
                "name": "multi_head_attention",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.add",
                            0,
                            0,
                            {
                                "value": [
                                    "tf.__operators__.add",
                                    0,
                                    0
                                ]
                            }
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.add",
                            0,
                            0,
                            {}
                        ],
                        [
                            "multi_head_attention",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 0.0001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization",
                "inbound_nodes": [
                    [
                        [
                            "add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_2",
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization_1",
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "name": "flatten",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_3",
                "inbound_nodes": [
                    [
                        [
                            "flatten",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_4",
                "inbound_nodes": [
                    [
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_4",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.10.0",
    "backend": "tensorflow"
}