{
    "class_name": "Functional",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        18
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "name": "tf.__operators__.getitem",
                "inbound_nodes": [
                    [
                        "input_1",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                null,
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "class_name": "MultiHeadAttention",
                "config": {
                    "name": "multi_head_attention",
                    "trainable": true,
                    "dtype": "float32",
                    "num_heads": 2,
                    "key_dim": 32,
                    "value_dim": 32,
                    "dropout": 0.0,
                    "use_bias": true,
                    "output_shape": null,
                    "attention_axes": [
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "query_shape": [
                        null,
                        1,
                        18
                    ],
                    "key_shape": [
                        null,
                        1,
                        18
                    ],
                    "value_shape": [
                        null,
                        1,
                        18
                    ]
                },
                "name": "multi_head_attention",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem",
                            0,
                            0,
                            {
                                "value": [
                                    "tf.__operators__.getitem",
                                    0,
                                    0
                                ]
                            }
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.__operators__.add",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.add"
                },
                "name": "tf.__operators__.add",
                "inbound_nodes": [
                    [
                        "multi_head_attention",
                        0,
                        0,
                        {
                            "y": [
                                "tf.__operators__.getitem",
                                0,
                                0
                            ],
                            "name": null
                        }
                    ]
                ]
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.1,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout",
                "inbound_nodes": [
                    [
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "name": "flatten",
                "inbound_nodes": [
                    [
                        [
                            "dropout",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "flatten",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_2",
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_2",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.10.0",
    "backend": "tensorflow"
}